{
    "pair_173": {
        "Text 1": "Cinco de mayo means margaritas and sangria and all things fried... this great place does a nice job with combining flavors of several different ethnicities and backgrounds and develops recipes that are unique.  Although not touted as a \"Mexican\" destination they know how to rock the rock salt and pour that tequila.  They also just opened a wine bar a couple doors down for overflow and specialty bottles.  A high five for the on the rocks margaritas and house made white or red sangria - definitely worth the trip!",
        "Text 2": "This place is a hidden gem for Cinco de Mayo enthusiasts. With a diverse menu combining flavors from various cuisines, they create unique and tantalizing recipes. Despite not being specifically Mexican, they excel at margaritas and tequila. The newly opened wine bar next door is perfect for overflow and specialty bottles. The on the rocks margaritas and house-made sangria are outstanding. A must-visit destination!",
        "Preferred": "Human",
        "chosentext": "Cinco de mayo means margaritas and sangria and all things fried... this great place does a nice job with combining flavors of several different ethnicities and backgrounds and develops recipes that are unique.  Although not touted as a \"Mexican\" destination they know how to rock the rock salt and pour that tequila.  They also just opened a wine bar a couple doors down for overflow and specialty bottles.  A high five for the on the rocks margaritas and house made white or red sangria - definitely worth the trip!"
    },
    "pair_54": {
        "Text 1": "Replaced 2 old 70s lennox with 2 new ones.  They did a great job and have been runnong for 3 years now.",
        "Text 2": "I replaced 2 old 70s Lennox units with new ones and they have been running smoothly for 3 years. Great job!",
        "Preferred": "AI",
        "chosentext": "I replaced 2 old 70s Lennox units with new ones and they have been running smoothly for 3 years. Great job!"
    },
    "pair_1742": {
        "Text 1": "I absolutely love it here! Great atmosphere, wide range of options, and the lunch bento boxes are amazing. Don't miss out on their boba either. Those who complain are just overly picky. Give their beef braised soup a try, it's hearty and delicious.",
        "Text 2": "Love it here\n\nThe atmosphere is great the options are more than average and the lunch bento boxes are great.  If you have the opportunity always try the boba as well.\n\nThose complaining are just picky and should go back to eating at home.  \n\nTry their beef braised soup as it is hearty and delicious.",
        "Preferred": "Human",
        "chosentext": "Love it here\n\nThe atmosphere is great the options are more than average and the lunch bento boxes are great.  If you have the opportunity always try the boba as well.\n\nThose complaining are just picky and should go back to eating at home.  \n\nTry their beef braised soup as it is hearty and delicious."
    },
    "pair_1227": {
        "Text 1": "Food - Cheap and large selection. \nService - Poor. They forgot our order, no apology, and 15 minutes of waiting. Disappointing customer service.",
        "Text 2": "Cheap food and large selection. Unfortunately, they forgot our order, we waited 15 minutes and they were not even sorry about it. Bad customer service.",
        "Preferred": "AI",
        "chosentext": "Food - Cheap and large selection. \nService - Poor. They forgot our order, no apology, and 15 minutes of waiting. Disappointing customer service."
    },
    "pair_1724": {
        "Text 1": "Shepard's lacks accountability and provides poor customer service. Despite finding my lost organizer, they refused to address the missing $100 bill and did not take any steps to investigate the issue or help me retrieve my money. It is frustrating that they do not take responsibility for their guests' belongings.",
        "Text 2": "I mistakenly left my organizer/wallet on my table when eating at Shepard's yesterday (6/24/12). I realized the mistake early this morning and called Shepard's. I was told that no one turned in anything resembling my organizer. \n\nI called back a few hours later to try and determine who bussed my table and what management was on duty and was told that my organizer had indeed been found and was in the \"safe\". I asked about the contents of the wallet and discovered that everything was present except for a $100 bill that I had just gotten the night before. I have witnesses to the $100 bill being in the organizer. \n\nI went today to retrieve the organizer and met with the assistant manager, who told me it was not their responsibility to keep track of guests belongings and would not investigate the issue whatsoever. She would not approach the server, would not ask who turned the organizer in, would not ask who stored it in the safe and essentially told me it was not her problem. \n\nThis is customer service at it's worst... I have no recourse at this establishment to even try to get my money back. I am incensed that they won't even conduct an investigation for me.",
        "Preferred": "AI",
        "chosentext": "Shepard's lacks accountability and provides poor customer service. Despite finding my lost organizer, they refused to address the missing $100 bill and did not take any steps to investigate the issue or help me retrieve my money. It is frustrating that they do not take responsibility for their guests' belongings."
    },
    "pair_1561": {
        "Text 1": "Overall, the service was excellent and the chocolate cake for dessert was amazing. However, the disappointment came from the food, which was not up to expectations. The egg drop soup was hot, but the rest of the dishes were served at room temperature. The shrimp with candied walnuts was overly sweet and didn't complement the bland brown rice. Despite being accommodating to food allergies, PF Changs failed to impress.",
        "Text 2": "I came in with high hopes and left with slight disappointment. \n\nOur server was super attentive, and very friendly; however I feel like the food was disappointing. Our egg drop soup came out right away at a nice piping hot temperature and when the rest of our food came out it was practically room temperature. \n\nFeeling adventurous, I had ordered the Shrimp with Candied Walnuts entree with brown rice while he ordered the Sesame Chicken platter. I like the idea of sharing food, but my food was too busy all on its own without adding something else to the mix. The brown rice was cold and very bland while the shrimp was overly sweet and I didn't feel like the candied walnuts and melon balls were complementary flavors.\n\nThe chocolate cake we had for dessert was amazing though; 6 layers of chocolate on chocolate. It was so sweet and rich, we ended up sharing a slice.\n\nSo to sum up, service was great, dessert was great, but the food needs some work. Sorry PF Changs, I just am not impressed.\n\nOne thing I will note (that our server told us) is that they are very big on catering to food allergies (especially gluten).",
        "Preferred": "AI",
        "chosentext": "Overall, the service was excellent and the chocolate cake for dessert was amazing. However, the disappointment came from the food, which was not up to expectations. The egg drop soup was hot, but the rest of the dishes were served at room temperature. The shrimp with candied walnuts was overly sweet and didn't complement the bland brown rice. Despite being accommodating to food allergies, PF Changs failed to impress."
    },
    "pair_1301": {
        "Text 1": "Yum! This is a great place to go with a few friends to share their delicious and nicely portioned cheese while enjoying a beer from their extensive drink list. 5 stars purely because of how much I loved their cheese selection and appreciated the staff's knowledge of each cheese.  I'd happily go back although this is not a place I'd go to have inexpensive drinks.",
        "Text 2": "This place is an absolute gem for cheese lovers looking to share a delightful variety with friends, paired with a wide selection of drinks. The staff's impressive knowledge of each cheese adds to the overall experience. Although not budget-friendly for drinks, I would definitely return. A solid 5-star rating.",
        "Preferred": "Human",
        "chosentext": "Yum! This is a great place to go with a few friends to share their delicious and nicely portioned cheese while enjoying a beer from their extensive drink list. 5 stars purely because of how much I loved their cheese selection and appreciated the staff's knowledge of each cheese.  I'd happily go back although this is not a place I'd go to have inexpensive drinks."
    },
    "pair_871": {
        "Text 1": "I highly recommend Stigma for tattoos! I got two tattoos by Eddie and he did an amazing job. The entire staff is friendly and accommodating, especially with my back issues. I also received a discount through Yelp and bought their tattoo ointment, which is soothing. Overall, great artists and great experience.",
        "Text 2": "Just got 2 tattoos at Stigma today and I am so happy! I went there because they have good reviews and their website is good. I got a cluster or roses on my shoulder with some \"brush strokes\" of color on them. My tattoo artist is Eddie. He is very friendly and fun! He did exactly like I asked. He is a very good artist. His line work is perfect and so I will be going back to him for more. I have a bad back (bulging and hemorrhaged discs) and sometimes I can't sit in the same place for long periods of time. Eddie was very helpful and accommodating with that. While I was there I talked to pretty much every employee there. The entire staff are really friendly. It's a cool place to be. I did a Yelp check-in and got $10 off! How cool is that?! On the website I saw that the owner, Chino developed his own tattoo ointment. He said that he just wasn't very happy with the other stuff that's out there because they are petroleum product so he did a ton of research and developed his own. It has ingredients like sunflower and soybean oil, lavender, beeswax, vitamin E, Shea and cocoa butter. I bought some and it is indeed very soothing. If you are looking to get inked, go here. You will be in good hands with some great artists and you will be just as happy as I am right now.",
        "Preferred": "AI",
        "chosentext": "I highly recommend Stigma for tattoos! I got two tattoos by Eddie and he did an amazing job. The entire staff is friendly and accommodating, especially with my back issues. I also received a discount through Yelp and bought their tattoo ointment, which is soothing. Overall, great artists and great experience."
    },
    "pair_498": {
        "Text 1": "The shrimp and grits at this place are unbeatable, and the fresh juices complement the meal perfectly. Even after two visits in two years, my fiance still believes it's the best he's ever had.",
        "Text 2": "Best shrimp and grits in NOLA! Delicious fresh juices too. This is my fiance's second time here in two years and he still thinks it's the best he's tried.",
        "Preferred": "AI",
        "chosentext": "The shrimp and grits at this place are unbeatable, and the fresh juices complement the meal perfectly. Even after two visits in two years, my fiance still believes it's the best he's ever had."
    },
    "pair_382": {
        "Text 1": "After today's lunch, Iris has moved to the top of my New Orleans favorites lists--no small feat in a city where restaurants are numerous and culinary competition is fierce. Iris excels in every area: food, drinks, service, atmosphere, location, music and overall graciousness. I made the reservation for 10-15 people, not knowing exactly how many in my party would show up. Iris pulled out all the stops to make sure everyone had comfortable seating and even prepared an overflow table for us. At no time did we feel jostled or rushed, which is a common fine dining concern. \n\nThe layout of the restaurant allowed diners to move freely to and from the table and to exchange seats as needed. The music selection was fun and unique, ranging from the Magnetic Fields to Johnny Cash. It was also quiet enough to be enjoyed while allowing conversation to flow unimpeded. Our waiter had excellent timing and anticipated our every need. \n\nThough they don't have a full drink menu for lunch (I hear they have an amazing mixologist for the dinner hour) they do offer a selection of martinis and wines. One of the guests has accounts with several high-end bars in the Quarter, and the drink list passed his muster. Our table settled for Chardonnays, Perseco and chilled shots of Chartreuse, though I hear they have several types of absinthe as well. \n\nOur group began with slices of warm, heavenly bread that Iris bakes in house. We continued with an assortment of salads--I had the Hollygrove arugula with warm goat cheese, niçoise olives and balsamic vinaigrette. It was fresh perfection. A few of us opted for the mussels, which I heard were delicious. For my main course, I had a wonderful drum with onions prepared in a tangy soy reduction, which was an elegant complement for the fish. I also heard rave reviews about the gnocci and chicken. \n\nAll the entrees were creatively arranged and selected, and at no point did I feel overwhelmed or that any fuss or pretense had gone into the food. I also appreciated that the portions were European-sized (it always makes me laugh when other Americans list too-small portion size as a complaint even when the food is well-prepared!). Iris prepares a lot of their basic ingredients in-house, and I appreciate that the kitchen makes a point of incorporating gulf fish and produce purchased from local, farmer-friendly markets. \n\nWe settled on the prix fixe menu, which was $20 a person for appetizer, main course and the dessert of the day (the best strawberry sorbet I have had yet). With the added drinks and tip it came out to under $35 a person, which is an excellent price for such a delicious white-linen lunch. No matter the size of my group, I will definitely be returning!",
        "Text 2": "Iris has earned its spot at the top of my favorites list in New Orleans. From the excellent food and drinks, to the impeccable service and inviting atmosphere, every aspect of this restaurant surpassed my expectations. Despite not knowing the exact number of guests, Iris went above and beyond to ensure our comfort. The layout allowed for easy movement, and the music selection was enjoyable without disrupting conversation. Our waiter was attentive and anticipated our needs perfectly. The limited lunch drink menu did not disappoint, and the food was creatively arranged and delicious. I appreciated the European-sized portions and the use of locally sourced ingredients. Opting for the prix fixe menu offered great value, and I will definitely be returning regardless of the group size.",
        "Preferred": "AI",
        "chosentext": "Iris has earned its spot at the top of my favorites list in New Orleans. From the excellent food and drinks, to the impeccable service and inviting atmosphere, every aspect of this restaurant surpassed my expectations. Despite not knowing the exact number of guests, Iris went above and beyond to ensure our comfort. The layout allowed for easy movement, and the music selection was enjoyable without disrupting conversation. Our waiter was attentive and anticipated our needs perfectly. The limited lunch drink menu did not disappoint, and the food was creatively arranged and delicious. I appreciated the European-sized portions and the use of locally sourced ingredients. Opting for the prix fixe menu offered great value, and I will definitely be returning regardless of the group size."
    },
    "pair_597": {
        "Text 1": "Went to see Star Wars Rogue One yesterday in 3D.  Buying the tickets was a breeze, and the atmosphere was inviting.  Found the comfortable seats with no problem and ordered right away before the movie began.  I ordered pretzel sticks - food was hot, prompt & delicious.  I was excited for the movie to begin.  Once the advertisements were done and the movie started, that's when I noticed something wasn't right.  The entire screen was so dark that I was not able to make out the faces of the actors on the screen.  I kept lifting up the 3D glasses to see if it made a difference - nope.  The two people seated next to me were noticing the same and complaining.  I thought that maybe this is how the movie was filmed?  Then it got worse.  Even with the 3D glasses on, the shadows in the background on the screen were double and there was no discerning most actors' faces at all.  I got up and went to the lobby and asked for the manager.  The gentleman wore a blue shirt, middle age with a beard, said that this was the 3D experience, it was a \"closed-system\" and there was nothing he could do.  I simply asked him to come with me into the theater to see with his own eyes how dark it was.  He would not and did not.  I suspect this wasn't the first time he's heard this from a customer.  I've seen normal movies at this location before, but this was my first, and last experience with their 3D in room #1.",
        "Text 2": "I had a disappointing experience watching Star Wars Rogue One in 3D at this theater. The ticket purchase and atmosphere were good, and the food was delicious. However, the screen was extremely dark, making it difficult to see the actors' faces. Even the 3D glasses didn't help, as the shadows in the background were double. The manager was unhelpful and refused to acknowledge the issue. I won't be returning for their 3D showings.",
        "Preferred": "Human",
        "chosentext": "Went to see Star Wars Rogue One yesterday in 3D.  Buying the tickets was a breeze, and the atmosphere was inviting.  Found the comfortable seats with no problem and ordered right away before the movie began.  I ordered pretzel sticks - food was hot, prompt & delicious.  I was excited for the movie to begin.  Once the advertisements were done and the movie started, that's when I noticed something wasn't right.  The entire screen was so dark that I was not able to make out the faces of the actors on the screen.  I kept lifting up the 3D glasses to see if it made a difference - nope.  The two people seated next to me were noticing the same and complaining.  I thought that maybe this is how the movie was filmed?  Then it got worse.  Even with the 3D glasses on, the shadows in the background on the screen were double and there was no discerning most actors' faces at all.  I got up and went to the lobby and asked for the manager.  The gentleman wore a blue shirt, middle age with a beard, said that this was the 3D experience, it was a \"closed-system\" and there was nothing he could do.  I simply asked him to come with me into the theater to see with his own eyes how dark it was.  He would not and did not.  I suspect this wasn't the first time he's heard this from a customer.  I've seen normal movies at this location before, but this was my first, and last experience with their 3D in room #1."
    },
    "pair_184": {
        "Text 1": "Great takeout experience from Village Whiskey! Despite the pricy Whiskey Burger at $26, it's absolutely worth it if you enjoy a greasier burger. It's super tender with awesome bacon, and a generous portion size. Highly recommend if you don't mind the price. The Duck Fat fries are also rich and delicious.",
        "Text 2": "Picked up takeout from Village Whiskey (so I can't review the actual restaurant). The Whiskey Burger is pricy ($26) but is amazing if you're ok with a greasier burger. Super tender, the bacon is awesome and it's pretty big. If you can get past the price then highly recommend it. The Duck Fat fries are also rich and delicious.",
        "Preferred": "AI",
        "chosentext": "Great takeout experience from Village Whiskey! Despite the pricy Whiskey Burger at $26, it's absolutely worth it if you enjoy a greasier burger. It's super tender with awesome bacon, and a generous portion size. Highly recommend if you don't mind the price. The Duck Fat fries are also rich and delicious."
    },
    "pair_1992": {
        "Text 1": "We've been meaning to stop in, and tonight, we finally did. And glad we were!\n\nThere isnt much different to say that everyone hasnt already said, so I will just reiterate some of the reasons why Taste of Havana will become a regular spot for us. \n\nI had the Pan con Bistec, and my wife had the Cuban. We loved the bread (and everything between it). Usually we take home half our sandwiches to eat for a second meal, but I just wasnt ready to stop eating for the night, so alas, I dont have another meal. Guess I'll just have to go back! \n\nAnd the company was just as inviting. We chatted with Diana (Dayana?), for quite a while after we ate, and she told us how she and her dad opened the restuarant, and how it really is a labor of love. \n\nTry it out. Order a sandwich, have a seat, chat them up, and enjoy! I'm already looking forward to our next visit, and thinking about who else I want to bring with us.\n\nThank you for a wonderful evening!",
        "Text 2": "We finally visited Taste of Havana and we are glad we did! The Pan con Bistec and Cuban sandwiches were amazing, we couldn't resist finishing them. The owner, Diana (or Dayana), was very friendly and shared her heartfelt story of opening the restaurant. We highly recommend trying their sandwiches and enjoying the inviting atmosphere. We are already excited for our next visit and planning to bring friends along. Thank you for a memorable evening!",
        "Preferred": "Human",
        "chosentext": "We've been meaning to stop in, and tonight, we finally did. And glad we were!\n\nThere isnt much different to say that everyone hasnt already said, so I will just reiterate some of the reasons why Taste of Havana will become a regular spot for us. \n\nI had the Pan con Bistec, and my wife had the Cuban. We loved the bread (and everything between it). Usually we take home half our sandwiches to eat for a second meal, but I just wasnt ready to stop eating for the night, so alas, I dont have another meal. Guess I'll just have to go back! \n\nAnd the company was just as inviting. We chatted with Diana (Dayana?), for quite a while after we ate, and she told us how she and her dad opened the restuarant, and how it really is a labor of love. \n\nTry it out. Order a sandwich, have a seat, chat them up, and enjoy! I'm already looking forward to our next visit, and thinking about who else I want to bring with us.\n\nThank you for a wonderful evening!"
    },
    "pair_125": {
        "Text 1": "Stopped in for lunch with my girlfriend and were impressed by the spotless environment. The food was outstanding and reasonably priced. Can't wait for our next visit!",
        "Text 2": "Stopped in for the lunch menu with my girlfriend, place was extremely clean, food was ON POINT!  And AFFORDABLE Can't wait to go back!!",
        "Preferred": "Human",
        "chosentext": "Stopped in for the lunch menu with my girlfriend, place was extremely clean, food was ON POINT!  And AFFORDABLE Can't wait to go back!!"
    },
    "pair_530": {
        "Text 1": "Great hiking, biking, running spot. Lots of well maintained paths. Beautiful views and spots with shade which is great when you're hiking in the heat. Only complaint is that people don't follow the dogs on leash rule and I came across at least 6 dogs off leash and away from their owners. Just follow the rules or they will make it a no dog spot!!!!",
        "Text 2": "Fantastic location for outdoor activities like hiking, biking, and running with well-maintained paths, stunning views, and shady spots. However, the only drawback is people not adhering to the dogs on leash rule, with at least 6 off-leash dogs encountered. It's crucial to follow the rules; otherwise, they might ban dogs altogether.",
        "Preferred": "AI",
        "chosentext": "Fantastic location for outdoor activities like hiking, biking, and running with well-maintained paths, stunning views, and shady spots. However, the only drawback is people not adhering to the dogs on leash rule, with at least 6 off-leash dogs encountered. It's crucial to follow the rules; otherwise, they might ban dogs altogether."
    },
    "pair_1101": {
        "Text 1": "Love this place introduced almost 25 years ago when I enrolled at the UD and have loved ever since. For longest time it was basically just a Delaware treat but so happy it is so many more places now. Just want to know when you are coming to the Huntsville AL area. Sorry this review is not about this specific location but if it is half as good as others I have been to it will be great!!! This location has plenty of seating was real clean and playing good tunes as I waited. About only negative is it doesn't have Herrs chips like the Delaware locations but that is not really a problem.",
        "Text 2": "I have been a fan of this place for almost 25 years and continue to love it. It started as a Delaware treat, but I'm glad it's expanding to more locations. I hope they come to the Huntsville AL area soon. Although this review is not about this specific location, if it's as good as others I've been to, it will be great! The seating was plentiful, the place was clean, and they were playing good music while I waited. The only downside is that they don't have Herrs chips like the Delaware locations, but that's not a big problem.",
        "Preferred": "Human",
        "chosentext": "Love this place introduced almost 25 years ago when I enrolled at the UD and have loved ever since. For longest time it was basically just a Delaware treat but so happy it is so many more places now. Just want to know when you are coming to the Huntsville AL area. Sorry this review is not about this specific location but if it is half as good as others I have been to it will be great!!! This location has plenty of seating was real clean and playing good tunes as I waited. About only negative is it doesn't have Herrs chips like the Delaware locations but that is not really a problem."
    },
    "pair_666": {
        "Text 1": "We arrived for lunch at 12pm on a Friday, and despite it being not busy, service was incredibly slow. Despite being pleasant and kind, we had to complain numerous times just to get our beverages. Additionally, it took them 40 minutes to inform us that a beer we ordered was no longer available. While the food was good, the prolonged wait and slow service made it not worth it.",
        "Text 2": "We arrived for lunch at 12p on a Friday - wasn't busy at all. It took FOREVER to get anything. We were really pleasant and kind but we had to complain several times to get any beverages that we ordered. It took them 40 minutes to let us know that a beer we ordered was no longer available. The food was great, but not worth the lengthy wait and slow service.",
        "Preferred": "AI",
        "chosentext": "We arrived for lunch at 12pm on a Friday, and despite it being not busy, service was incredibly slow. Despite being pleasant and kind, we had to complain numerous times just to get our beverages. Additionally, it took them 40 minutes to inform us that a beer we ordered was no longer available. While the food was good, the prolonged wait and slow service made it not worth it."
    },
    "pair_760": {
        "Text 1": "It may be a bit pricey, but it's good food in the cafe and a good selection in the grocery. I love their vegan sandwich and tofu melt and they always have a great selection of vegan sweets.",
        "Text 2": "Overall, this cafe offers tasty food and a wide variety of options at their grocery section. Although slightly expensive, the quality justifies the price. I particularly enjoyed their vegan sandwich and tofu melt, accompanied by an extensive assortment of vegan desserts.",
        "Preferred": "AI",
        "chosentext": "Overall, this cafe offers tasty food and a wide variety of options at their grocery section. Although slightly expensive, the quality justifies the price. I particularly enjoyed their vegan sandwich and tofu melt, accompanied by an extensive assortment of vegan desserts."
    },
    "pair_1772": {
        "Text 1": "The hi-energy gym in Tampa is impressive! I utilized my Perms Plus membership while visiting from Atlanta and had a great experience. The yoga class was enjoyable, and the gym itself is spacious with a wide variety of equipment. Additionally, the free two-hour parking in the garage was convenient, and I even received two guest passes for my local coworker.",
        "Text 2": "Hi-energy gym!! I joined in Atlanta and was visiting Tampa and able to use my Perms Plus membership in Tampa. I took the yoga class which was nice. The gym is bigger and has more equipment than the Perimeter location in Atlanta. Parking in the garage was free up to two hours and I got to guest passes for local coworker.",
        "Preferred": "AI",
        "chosentext": "The hi-energy gym in Tampa is impressive! I utilized my Perms Plus membership while visiting from Atlanta and had a great experience. The yoga class was enjoyable, and the gym itself is spacious with a wide variety of equipment. Additionally, the free two-hour parking in the garage was convenient, and I even received two guest passes for my local coworker."
    },
    "pair_1821": {
        "Text 1": "Great experience! The bartender was amazing, offering ice-cold beer and a decent lunch menu. It's best to visit during non-peak hours for consistently good service. Will definitely return.",
        "Text 2": "Not to bad. I sat at the bar and the bartender was awesome. The lunch menu here is very decent and the beer is ice cold.  I usually come during lunch when it isn't to congested. So, to get consistent service,  go when it isn't to congested. I will definitely go back?",
        "Preferred": "AI",
        "chosentext": "Great experience! The bartender was amazing, offering ice-cold beer and a decent lunch menu. It's best to visit during non-peak hours for consistently good service. Will definitely return."
    }
}