{
    "pair_430": {
        "Text 1": "This Whole Foods location is a gem. The variety of natural cosmetics and handmade soaps in the personal care section is unmatched. The produce, seafood, and cheese are also top-notch. The deli offers a delightful selection of soup, salad, and sushi to-go boxes. And don't forget to try the lavender soda for a truly calming experience.",
        "Text 2": "We've been shopping here since this location was a Wild Oats. Perhaps I'm just imagining things, but I'd swear it has gotten better since the merger of these two chains.\n\nI love the produce, seafood and cheese here. But it's the personal care section with tons o' natural cosmetics, handmade soaps and the like that brings us in most often. Well, that and the salad bar. In the cooler months, nothing beats hitting Whole Foods for a post-yoga lunch of soup and salad or the deli salad sampler plate. The Carrot Ginger, Split Pea and Corn Chowder soups are the best! Other sure bets: the curried tofu salad (or pretty much any of the deli-made tofu items), sushi to-go boxes and the everything cookies. My most recent find: lavender soda - kinda' dry and really does relax you :-)",
        "Preferred": "Human",
        "chosentext": "We've been shopping here since this location was a Wild Oats. Perhaps I'm just imagining things, but I'd swear it has gotten better since the merger of these two chains.\n\nI love the produce, seafood and cheese here. But it's the personal care section with tons o' natural cosmetics, handmade soaps and the like that brings us in most often. Well, that and the salad bar. In the cooler months, nothing beats hitting Whole Foods for a post-yoga lunch of soup and salad or the deli salad sampler plate. The Carrot Ginger, Split Pea and Corn Chowder soups are the best! Other sure bets: the curried tofu salad (or pretty much any of the deli-made tofu items), sushi to-go boxes and the everything cookies. My most recent find: lavender soda - kinda' dry and really does relax you :-)"
    },
    "pair_376": {
        "Text 1": "Let's be honest, this place needs a face lift. It's starting to feel shady, I wouldn't even feel comfortable taking my small children here (if I had any, which I don't). The service is mediocre and everything looks tired. The comedy club doesn't feel cheerful or fun, it just feels like the back hallway of a banquet room.\n\nGreat parking and good location though. Please owners, please put some money into this place. It really needs it.",
        "Text 2": "This place is in desperate need of an update. It feels unsafe and definitely not suitable for kids. The service is average and everything looks worn out. The comedy club lacks any cheer or excitement, resembling a dingy banquet room. On the upside, the parking is convenient and the location is good. The owners should seriously consider investing in a renovation.",
        "Preferred": "Human",
        "chosentext": "Let's be honest, this place needs a face lift. It's starting to feel shady, I wouldn't even feel comfortable taking my small children here (if I had any, which I don't). The service is mediocre and everything looks tired. The comedy club doesn't feel cheerful or fun, it just feels like the back hallway of a banquet room.\n\nGreat parking and good location though. Please owners, please put some money into this place. It really needs it."
    },
    "pair_1641": {
        "Text 1": "This review is based on the location in Atlantic city.\n\nGot the strawberry flavor and O.M.G!!! I was not expecting it to be that good. It is not as sweet as others but it's perfect. It had little bits of strawberry in it. The price is really good also $2 for a small I believe. My only regret is not trying all the other flavors. Next time I'm in Philly/AC I will def be getting this!",
        "Text 2": "I tried the strawberry flavor at this Atlantic City location and it was amazing! It's not too sweet, but just perfect. I loved the added bits of strawberry in it. The price is also great, only $2 for a small size. My only regret is not trying the other flavors. I will definitely be getting this again next time I'm in Philly/AC!",
        "Preferred": "AI",
        "chosentext": "I tried the strawberry flavor at this Atlantic City location and it was amazing! It's not too sweet, but just perfect. I loved the added bits of strawberry in it. The price is also great, only $2 for a small size. My only regret is not trying the other flavors. I will definitely be getting this again next time I'm in Philly/AC!"
    },
    "pair_1436": {
        "Text 1": "Yesterday was my first visit to Paris Parker and I had a great experience! I usually rely on recommendations when choosing a stylist, but I needed to find someone quickly near my home. I was assigned to Stacey for a full highlight appointment and she did an amazing job. She eliminated all the brassy tones from my hair and made my blonde look natural and vibrant. I was pleasantly surprised that I didn't have to go back multiple times to get the color right - Stacey nailed it on the first try. She was also a pleasure to talk to, which made the hours in the chair fly by. I highly recommend Stacey, although I might regret it if she gets too busy.",
        "Text 2": "Yesterday was my first visit to Paris Parker. I have never gone to a stylist that didn't come with a recommendation in my life until now. I was short on time and wanted to go somewhere near my home.\n\nThey told me I would see Stacey for my full highlight appointment. \n\nShe was awesome!\n\nShe got all the brassy color out of my hair and made my blonde look natural and vibrant. \n\nBlonde hair isn't easy and I was expecting to have to go back a couple of times to someone new until they got it just right. I was wrong.\n\nStacey nailed the color and was really nice to chat with too! Also a must when hanging in a chair for hours. \n\nHighly recommend... Although I may regret it if she gets too booked up :)",
        "Preferred": "Human",
        "chosentext": "Yesterday was my first visit to Paris Parker. I have never gone to a stylist that didn't come with a recommendation in my life until now. I was short on time and wanted to go somewhere near my home.\n\nThey told me I would see Stacey for my full highlight appointment. \n\nShe was awesome!\n\nShe got all the brassy color out of my hair and made my blonde look natural and vibrant. \n\nBlonde hair isn't easy and I was expecting to have to go back a couple of times to someone new until they got it just right. I was wrong.\n\nStacey nailed the color and was really nice to chat with too! Also a must when hanging in a chair for hours. \n\nHighly recommend... Although I may regret it if she gets too booked up :)"
    },
    "pair_474": {
        "Text 1": "I will get straight to the point..... If you are ever anywhere near Camden NJ, In fact if you are anywhere in the State of NJ, get to Santana's for breakfast and pastries.   Their coffee puts Starbucks, DD, Micky D's and all the rest to shame!!   Their pastries are INCREDIBLE!!  You would have to fly to Boricua ( Puerto Rico) to even come close!!    My business is in neighboring Pennsauken, and we are there every morning!!!",
        "Text 2": "If you're in New Jersey, particularly in Camden, Santana's is a must-visit for breakfast and pastries. Their coffee surpasses Starbucks, Dunkin' Donuts, and other well-known chains. The pastries are exceptional and rival those in Boricua, Puerto Rico. As a neighboring business in Pennsauken, we make it a daily stop.",
        "Preferred": "Human",
        "chosentext": "I will get straight to the point..... If you are ever anywhere near Camden NJ, In fact if you are anywhere in the State of NJ, get to Santana's for breakfast and pastries.   Their coffee puts Starbucks, DD, Micky D's and all the rest to shame!!   Their pastries are INCREDIBLE!!  You would have to fly to Boricua ( Puerto Rico) to even come close!!    My business is in neighboring Pennsauken, and we are there every morning!!!"
    },
    "pair_192": {
        "Text 1": "This is my favorite restaurant!  I always order their ceviche, which is delicious.  The atmosphere is fun, and the service is great.  Alex was our server, and he was friendly, attentive and thoughtful.",
        "Text 2": "This restaurant is my absolute favorite! The ceviche is pure perfection. The atmosphere exudes fun and the service, led by Alex, is top-notch - friendly, attentive, and thoughtful.",
        "Preferred": "AI",
        "chosentext": "This restaurant is my absolute favorite! The ceviche is pure perfection. The atmosphere exudes fun and the service, led by Alex, is top-notch - friendly, attentive, and thoughtful."
    },
    "pair_1143": {
        "Text 1": "The Irish Pol: Great beer selection and lively atmosphere on Saturday nights, but disappointing happy hour experience. Dark and dingy interior with an older crowd. Will return for weekend fun, but not for happy hour.",
        "Text 2": "Late one Saturday night, some friends and I made the mistake of trying to get drinks at Plough and the Stars and left very quickly. We were walking around trying to find somewhere else to go, noticed this unmarked bar and decided to check it out. We were so excited to see that there were so many great beers on tap, and there was a decent crowd there so we stuck around. It was a fun night! And after a few weeks of wondering where we had gone, we were able to find the Irish Pol on Yelp :D\n\nI went back for happy hour recently and it wasn't exactly as I had remembered. It was pretty dark and dingy looking inside,  and the few people there were much much older. It just had a weird vibe. The beer was still great of course. The happy hour special was $3 drafts, but most of the beers I wanted weren't included. I won't be back for happy hour, but I would definitely stop in on a Saturday night!",
        "Preferred": "Human",
        "chosentext": "Late one Saturday night, some friends and I made the mistake of trying to get drinks at Plough and the Stars and left very quickly. We were walking around trying to find somewhere else to go, noticed this unmarked bar and decided to check it out. We were so excited to see that there were so many great beers on tap, and there was a decent crowd there so we stuck around. It was a fun night! And after a few weeks of wondering where we had gone, we were able to find the Irish Pol on Yelp :D\n\nI went back for happy hour recently and it wasn't exactly as I had remembered. It was pretty dark and dingy looking inside,  and the few people there were much much older. It just had a weird vibe. The beer was still great of course. The happy hour special was $3 drafts, but most of the beers I wanted weren't included. I won't be back for happy hour, but I would definitely stop in on a Saturday night!"
    },
    "pair_289": {
        "Text 1": "I went there for drinks and found the environment really nice with the brewery right there. The beer was good and the waiter was very knowledgable and kind",
        "Text 2": "I thoroughly enjoyed my visit to this place. The atmosphere was pleasant, and it was a treat to have the brewery on-site. The drinks were great, and the waiter was both knowledgeable and kind.",
        "Preferred": "AI",
        "chosentext": "I thoroughly enjoyed my visit to this place. The atmosphere was pleasant, and it was a treat to have the brewery on-site. The drinks were great, and the waiter was both knowledgeable and kind."
    },
    "pair_773": {
        "Text 1": "The drinks and food were excellent, especially the pulled pork and fried chicken po boy. The mac and cheese was outstanding. The prices were reasonable, and they had a great selection of draft beers. Additionally, it's a bonus that they serve food until 1am.",
        "Text 2": "Good drinks and food. Had the pulled pork and fried chicken po boy. Mac and cheese was amazing. Very reasonable for the price. Great draft list as well. Serves food till1am.",
        "Preferred": "AI",
        "chosentext": "The drinks and food were excellent, especially the pulled pork and fried chicken po boy. The mac and cheese was outstanding. The prices were reasonable, and they had a great selection of draft beers. Additionally, it's a bonus that they serve food until 1am."
    },
    "pair_1893": {
        "Text 1": "Johnny Tucci and his crew exceeded our expectations as videographers for our wedding. Their professionalism, punctuality, and extraordinary talent made our wedding footage resemble a cinematic masterpiece, leaving everyone who watched it in tears. Investing in a videographer is worth every penny, and Johnny and his team will not let you down.",
        "Text 2": "Johnny Tucci and his crew are the absolute best videographers, hands down. They are professional, prompt, and extremely talented. They made our wedding footage look like a movie production and brought everyone to tears that watched it. My advice is that if you are going to splurge in one area for your special day, spend it on a videographer. They do not disappoint.",
        "Preferred": "AI",
        "chosentext": "Johnny Tucci and his crew exceeded our expectations as videographers for our wedding. Their professionalism, punctuality, and extraordinary talent made our wedding footage resemble a cinematic masterpiece, leaving everyone who watched it in tears. Investing in a videographer is worth every penny, and Johnny and his team will not let you down."
    },
    "pair_197": {
        "Text 1": "Earl at the airport offers a decent selection of sandwiches, including turkey, tuna, and Hawaiian. I opted for the roast beef sandwich and it did not disappoint. The sliced beef was cooked perfectly and paired well with cheddar cheese and a delicious horseradish sauce. The sandwich is best enjoyed without lettuce or tomatoes. Conveniently located near the security station and Delta SkyClub, it's easy to grab and enjoy at the gate or onboard.",
        "Text 2": "As airport grab-and-go restaurants are, Earl does a decent job with a variety of sandwich options including turkey, tuna and even a Hawaiian. But today I could smell the roast beef and so I got that one. Yum. Good portion of sliced beef that was beyond medium cooked with cheddar cheese and a yummy horseradish sauce. Nope, don't get lettuce or tomatoes on it. It's perfect the way it is.\n\nAnd since it's right between the security station and the top of the D gates (right near the Delta SkyClub!), it's easy to get and eat at the gate or on board.",
        "Preferred": "AI",
        "chosentext": "Earl at the airport offers a decent selection of sandwiches, including turkey, tuna, and Hawaiian. I opted for the roast beef sandwich and it did not disappoint. The sliced beef was cooked perfectly and paired well with cheddar cheese and a delicious horseradish sauce. The sandwich is best enjoyed without lettuce or tomatoes. Conveniently located near the security station and Delta SkyClub, it's easy to grab and enjoy at the gate or onboard."
    },
    "pair_555": {
        "Text 1": "I have been a loyal patron of this place for years, and despite living in Colorado now, I make it a point to visit whenever I'm in Philadelphia for work. The menu offers a variety of delicious options, with generous portions and affordable prices. My personal favorite is the Indian Mee Goreng, it's so amazing that I wish I could eat it every day. Perhaps one day I'll be lucky enough to get the recipe from the manager so I can enjoy it even when I'm in CO.",
        "Text 2": "I've been coming to this place for years now, and even though I now live in Colorado, I come back here every time I'm in Philadelphia for work (which is often). I've tried many items on the menu and many were great, portions are generous, and prices are low. My go to item - Indian Mee Goreng, I can eat that every day of the week if I could, it's that good. Maybe one day I can get the recipe from the manager so I can actually do that on days I'm in CO.",
        "Preferred": "Human",
        "chosentext": "I've been coming to this place for years now, and even though I now live in Colorado, I come back here every time I'm in Philadelphia for work (which is often). I've tried many items on the menu and many were great, portions are generous, and prices are low. My go to item - Indian Mee Goreng, I can eat that every day of the week if I could, it's that good. Maybe one day I can get the recipe from the manager so I can actually do that on days I'm in CO."
    },
    "pair_89": {
        "Text 1": "I had the pleasure to meet with Ann today and not only was she extremely helpful and so positive, she went above and beyond to make my 1st experience here amazing and made it a absolute regular customer from this day forward. Thanks girlie!!",
        "Text 2": "Ann was incredibly helpful and positive during my first visit. She went above and beyond to ensure that I had an amazing experience. Thanks to her, I am now a regular customer. Thanks, girlie!",
        "Preferred": "Human",
        "chosentext": "I had the pleasure to meet with Ann today and not only was she extremely helpful and so positive, she went above and beyond to make my 1st experience here amazing and made it a absolute regular customer from this day forward. Thanks girlie!!"
    },
    "pair_690": {
        "Text 1": "Service was good. Mesquite wings are very good  best to share or save some don't be greedy like me and try.and go back to work. Only downside was the weak lemonade. It was the weakest I ever had.",
        "Text 2": "The service was good and the mesquite wings were excellent, perfect for sharing or saving some for later. However, the weak lemonade was the weakest I've ever had.",
        "Preferred": "Human",
        "chosentext": "Service was good. Mesquite wings are very good  best to share or save some don't be greedy like me and try.and go back to work. Only downside was the weak lemonade. It was the weakest I ever had."
    },
    "pair_1685": {
        "Text 1": "This place is VERY crowded and not in a good way - unless you enjoy smelling other people's BO while you eat and drink. Gag! I guess the smell of the patrons matches the smell of the bathrooms which are also gag worthy and dirty. \n\nThe prices aren't really great for the meh food available. Service was also meh. A few times we wondered if our server was every coming back. There are so many better options in Philly as a foodie city to try, so why waste your time and money here? Pass and head somewhere else.",
        "Text 2": "This place is extremely crowded in an unpleasant way. The strong odor of patrons' body odor mixed with dirty bathrooms makes for an unappetizing experience. The prices are not worth the average food, and the service is lacking. Numerous better options are available in Philly's food scene, so it's recommended to avoid wasting time and money here. Head elsewhere instead.",
        "Preferred": "Human",
        "chosentext": "This place is VERY crowded and not in a good way - unless you enjoy smelling other people's BO while you eat and drink. Gag! I guess the smell of the patrons matches the smell of the bathrooms which are also gag worthy and dirty. \n\nThe prices aren't really great for the meh food available. Service was also meh. A few times we wondered if our server was every coming back. There are so many better options in Philly as a foodie city to try, so why waste your time and money here? Pass and head somewhere else."
    },
    "pair_1023": {
        "Text 1": "Great dental service for wisdom teeth extraction. However, inconsistent dentist rotation over the past 5 years.",
        "Text 2": "I went here to get my wisdom teeth out and they did a great job. The only complaint I have is that I never see the same dentist. I've been going here for 5 years.",
        "Preferred": "Human",
        "chosentext": "I went here to get my wisdom teeth out and they did a great job. The only complaint I have is that I never see the same dentist. I've been going here for 5 years."
    },
    "pair_661": {
        "Text 1": "Excellent service! Replaced my dive watch battery in a jiffy at a fair price. Staff was friendly, prompt, and there were enough members to assist. Location is conveniently located.",
        "Text 2": "Replaced a dive watch battery in less than 5 minutes for a very reasonable fee.  Prompt, friendly service.  Plenty of staff.  Convenient location.",
        "Preferred": "Human",
        "chosentext": "Replaced a dive watch battery in less than 5 minutes for a very reasonable fee.  Prompt, friendly service.  Plenty of staff.  Convenient location."
    },
    "pair_911": {
        "Text 1": "Terrible service, extremely slow, and disorganized. Manager's attempt to make things right fell short. Not worth a visit, find better options. Avoid at all costs.",
        "Text 2": "They sat us within 5 minutes and then took 40 minutes to even bring out sodas. The table next to us had the same server and got their good before their beverages came out. After almost an hour there with no drinks we tracked down a manager who told us our good never even got entered. I'm on my honeymoon and the friend we were there with had a date to make. Appetizer was the only thing to make it out and was decent boneless wings. Even with the manager begging us to let her get our food together free and not walk out, the service was beyond dismal and slow. First and last time coming to a Beef's. Made us all late. If we had waited at our table for the food we would have made our year anniversary before it came out. Better choices for food elsewhere. Avoid this place at all costs",
        "Preferred": "Human",
        "chosentext": "They sat us within 5 minutes and then took 40 minutes to even bring out sodas. The table next to us had the same server and got their good before their beverages came out. After almost an hour there with no drinks we tracked down a manager who told us our good never even got entered. I'm on my honeymoon and the friend we were there with had a date to make. Appetizer was the only thing to make it out and was decent boneless wings. Even with the manager begging us to let her get our food together free and not walk out, the service was beyond dismal and slow. First and last time coming to a Beef's. Made us all late. If we had waited at our table for the food we would have made our year anniversary before it came out. Better choices for food elsewhere. Avoid this place at all costs"
    },
    "pair_1678": {
        "Text 1": "The salsa and guacamole is. Made fresh daily. The chips are home made as well. The shrimp burrito was huge but was tasty and fresh. The wait staff was just average.",
        "Text 2": "The salsa and guacamole are freshly made daily, accompanied by homemade chips. The shrimp burrito was sizable, yet delicious and fresh. The wait staff, however, was only average.",
        "Preferred": "AI",
        "chosentext": "The salsa and guacamole are freshly made daily, accompanied by homemade chips. The shrimp burrito was sizable, yet delicious and fresh. The wait staff, however, was only average."
    },
    "pair_897": {
        "Text 1": "Cockroach in my room, wifi is slower than aol in 1996, private beach costs $10 a chair. I'll never come here again.",
        "Text 2": "Terrible experience overall. Cockroach infestation, archaic wifi, and extortionate charges for a private beach. Will definitely avoid this place in the future.",
        "Preferred": "AI",
        "chosentext": "Terrible experience overall. Cockroach infestation, archaic wifi, and extortionate charges for a private beach. Will definitely avoid this place in the future."
    }
}