{
    "pair_339": {
        "Text 1": "This motel offers great value for the price. It is clean, comfortable, and well-managed. The breakfast buffet is average, but reasonable considering the rate. However, the pool is a disappointment as it is too small for laps. On a positive note, the lobby area is spacious and comfortable. If you are seeking a moderately priced, clean, and comfortable place to sleep, this motel will meet your needs effectively.",
        "Text 2": "As motels go this one is very nice for the rate. Clean, comfortable and well-managed. You get what you pay for so the breakfast buffet is just OK. The pool is too small to swim laps (disappointing). The lobby area is spacious and comportable. \n\nIf you are looking for a moderately priced place to sleep that is clean and comforable this will suit you just fine.",
        "Preferred": "AI",
        "chosentext": "This motel offers great value for the price. It is clean, comfortable, and well-managed. The breakfast buffet is average, but reasonable considering the rate. However, the pool is a disappointment as it is too small for laps. On a positive note, the lobby area is spacious and comfortable. If you are seeking a moderately priced, clean, and comfortable place to sleep, this motel will meet your needs effectively."
    },
    "pair_1373": {
        "Text 1": "Not mediocre at all IMHO.  Makes me wonder if Daniel O. went to the same place we did.\n\nThis is a great neighborhood byob place that provides welcoming service and excellent food at a reasonable price.  We started going here because numerous South Philly friends recommended it.  This is not foo-foo Italian.  This is not pretentious Italian.  This is \"let's go back and work our way through the menu\" Italian.  We found the specials to be good choices.  My husband's broccoli rabe and sausage was excellent, as was a grilled romaine salad with bleu cheese and pine nuts.  Both were generous enough to share.  Last time, sausage & figs was a hit.  If you are in the mood for a basic plate of macaronis with red gravy, you won't be disappointed either.  We had a great time with the waitress because my BIL brought a bottle of Great Wall wine from China (that was the 2nd bottle we opened) and that started a whole crazy discussion.  She didn't know us from Adam, but we left there feeling like regulars.\n\nIt's a very doable destination if you are on your way to a sporting event at the Linc or the Cit, or to the Spectrum or Wachovia Center.  For those who rely on public transportation, you can get off the subway at Broad & Oregon, then walk back a block to Broad & Porter.  Make a reservation, though because it can be a popular place.  You also want to make sure you have time to have a relaxing meal and make your event in time.",
        "Text 2": "This neighborhood BYOB place is a hidden gem. Excellent food, welcoming service, and reasonable prices make it stand out. The menu offers a variety of delicious Italian dishes, both traditional and unique. The specials are always a good choice. The atmosphere is friendly and the staff makes you feel like a regular. Conveniently located near sports venues and accessible by public transportation. Make sure to make a reservation as it can get busy. Overall, a must-try if you're in the area.",
        "Preferred": "AI",
        "chosentext": "This neighborhood BYOB place is a hidden gem. Excellent food, welcoming service, and reasonable prices make it stand out. The menu offers a variety of delicious Italian dishes, both traditional and unique. The specials are always a good choice. The atmosphere is friendly and the staff makes you feel like a regular. Conveniently located near sports venues and accessible by public transportation. Make sure to make a reservation as it can get busy. Overall, a must-try if you're in the area."
    },
    "pair_1727": {
        "Text 1": "This restaurant is attached to the Drury Plaza hotel, so it was conveniently located for dinner when you're not really familiar with the area. There were 20+ in our party each night and the service was pretty good. Only a few forgotten drinks, which was to be expected with such a large group. \nPortions are huge and food was good. I had the Cuban sandwich one night and it was massive but delicious. The shandy is good. The margaritas are not and I don't recommend their patron one. I forget the name but it wasn't that good. Their shrimp tacos have a kick but they're good too.",
        "Text 2": "Conveniently located restaurant attached to Drury Plaza hotel, perfect for unfamiliar area. Good service for our large group, only minor issue with forgotten drinks. Huge portions and delicious food, especially the massive and tasty Cuban sandwich. The shandy is good, but avoid the margaritas, particularly the patron one. The shrimp tacos have a kick, but are still tasty.",
        "Preferred": "Human",
        "chosentext": "This restaurant is attached to the Drury Plaza hotel, so it was conveniently located for dinner when you're not really familiar with the area. There were 20+ in our party each night and the service was pretty good. Only a few forgotten drinks, which was to be expected with such a large group. \nPortions are huge and food was good. I had the Cuban sandwich one night and it was massive but delicious. The shandy is good. The margaritas are not and I don't recommend their patron one. I forget the name but it wasn't that good. Their shrimp tacos have a kick but they're good too."
    },
    "pair_1561": {
        "Text 1": "I came in with high hopes and left with slight disappointment. \n\nOur server was super attentive, and very friendly; however I feel like the food was disappointing. Our egg drop soup came out right away at a nice piping hot temperature and when the rest of our food came out it was practically room temperature. \n\nFeeling adventurous, I had ordered the Shrimp with Candied Walnuts entree with brown rice while he ordered the Sesame Chicken platter. I like the idea of sharing food, but my food was too busy all on its own without adding something else to the mix. The brown rice was cold and very bland while the shrimp was overly sweet and I didn't feel like the candied walnuts and melon balls were complementary flavors.\n\nThe chocolate cake we had for dessert was amazing though; 6 layers of chocolate on chocolate. It was so sweet and rich, we ended up sharing a slice.\n\nSo to sum up, service was great, dessert was great, but the food needs some work. Sorry PF Changs, I just am not impressed.\n\nOne thing I will note (that our server told us) is that they are very big on catering to food allergies (especially gluten).",
        "Text 2": "Overall, the service was excellent and the chocolate cake for dessert was amazing. However, the disappointment came from the food, which was not up to expectations. The egg drop soup was hot, but the rest of the dishes were served at room temperature. The shrimp with candied walnuts was overly sweet and didn't complement the bland brown rice. Despite being accommodating to food allergies, PF Changs failed to impress.",
        "Preferred": "AI",
        "chosentext": "Overall, the service was excellent and the chocolate cake for dessert was amazing. However, the disappointment came from the food, which was not up to expectations. The egg drop soup was hot, but the rest of the dishes were served at room temperature. The shrimp with candied walnuts was overly sweet and didn't complement the bland brown rice. Despite being accommodating to food allergies, PF Changs failed to impress."
    },
    "pair_203": {
        "Text 1": "This place is simply the best. The name says it all. If you're not a fan of chicken, then this isn't the place for you. Their chicken is exceptional! Also, make sure to try their delicious fried corn on the cob. It's amazing!",
        "Text 2": "This place is just the best. If you really have to ask why it's all in the name itself. If u don't like chicken then don't come here bc their birds are fly! Don't forget to try their fried corn on the cobs. It's dank!",
        "Preferred": "AI",
        "chosentext": "This place is simply the best. The name says it all. If you're not a fan of chicken, then this isn't the place for you. Their chicken is exceptional! Also, make sure to try their delicious fried corn on the cob. It's amazing!"
    },
    "pair_1062": {
        "Text 1": "Pretty good bagels, be sure to ask for extra cream cheese if you like a lot. The people are always pleasant which is unique to Dunedin. The bad thing is the guy doesn't wash his hands or wear gloves. He took a previous customers money, my money,  used the phone and wiped his nose, then he made my bagel. I won't go back. If this doesn't bother you, the bagels are pretty good.",
        "Text 2": "Pretty good bagels with friendly staff, but unfortunately, poor hygiene practices observed. The guy handling transactions didn't wash his hands or wear gloves, which made me uncomfortable. He handled money, used the phone, and wiped his nose before making my bagel. I won't be returning, but if hygiene isn't a concern for you, the bagels are tasty.",
        "Preferred": "AI",
        "chosentext": "Pretty good bagels with friendly staff, but unfortunately, poor hygiene practices observed. The guy handling transactions didn't wash his hands or wear gloves, which made me uncomfortable. He handled money, used the phone, and wiped his nose before making my bagel. I won't be returning, but if hygiene isn't a concern for you, the bagels are tasty."
    },
    "pair_200": {
        "Text 1": "The hotel is too big, expensive, and far from Downtown. The meals are overpriced and there are limited options nearby. Getting the car from valet and going to restaurants off the property is time-consuming. However, the property itself is gorgeous, and the room was spacious and well-equipped. There was an issue with the billing and the check-out process was a nightmare. Despite potential future conferences, the reviewer is not looking forward to returning.",
        "Text 2": "Too big, too expensive and too far from Downtown.  \n\nI was here for a conference, which seemed like an awesome idea. It wasn't.  I'm in Direct Sales and (like most people at this conference) don't have tons of extra money to spend on mediocre meals when I'm traveling.  $10 for a slice of generic pizza, small side salad and a soda for lunch.   I understand it's a hotel but there weren't any options close by.  Just getting your car from valet was a hassle and took a lot of time.  Being such a big property, it made getting to restaurants off the property really time intensive.  Since you're so far out of Nashville (out near the airport), the good little holes you find when you're in a city are pretty nonexistent.  \n\nThe property itself was great.  The hotel is HUGE but really pretty.  I enjoyed walking around but was really happy when I found what I didn't know existed...a shortcut between my room and the Convention Center.  It took my 10-15 minute walk down to about 3 minutes!  BONUS!  Like I said, this place is ginormous.  \n\nRoom: Our room was great.  I shared a wonderful suite in the Garden Conservatory with 2 other girls.  We were under a group rate and my friend was quoted $200/night, which is awesome for the space we had.  We had a large room (probably used as a hospitality suite for groups) for socializing.  It had a great bar area set-up and a nice big fridge and lots of drawer space.  Our bedroom was separated by doors that could be locked from either side (like an adjoining room), so it looked like the hospitality suite could be reserved without reserving the room.  It was different than what I was expecting, but whatevs.  It was fine.  So, I wasn't there at check-in.  The girl who reserved the room checked in a couple days earlier than my friend and I.  So, Sunday comes, and the bill was waiting for us when we woke up.  Our friend was charged $1200 for one room (I'm guessing the suite) and $1400 for the other room.  YEP.  She reserved what she thought was a 2 room suite for $200.  The bedroom door was closed when she got there and she asked them to open it up. It was all arranged by the bellman.  She was never told that the bedroom wasn't included....kind of necessary if you're staying over for 6 nights, dontcha think???  So, she's being charged $2600 for what was supposed to be $1200.  Last I heard, the Gaylord's legal department was investigating what she was told, what she wasn't told and if they should charge her the entire amount.  \n\nCheckout:  A FREAKING NIGHTMARE.  Between the money situation, which was not resolved as of late this week, and the 45 minute wait for a cart (in a hotel that holds thousands of people, you'd think they'd be plentiful and they aren't) and a 25 minute wait for the car, my friend and I decided to sweat it out and schlep our goods to the door where our car would be delivered to us.  It was not a short walk and we had a TON of stuff, which meant multiple trips.  UGH.\n\nI'm sure I'll be back for another conference (I am pretty sure my company has booked this for at least one more year....) but I'm not going to be happy about it.  I might even consider driving down, staying in a hotel somewhere downtown and driving out to the Conference stuff.",
        "Preferred": "Human",
        "chosentext": "Too big, too expensive and too far from Downtown.  \n\nI was here for a conference, which seemed like an awesome idea. It wasn't.  I'm in Direct Sales and (like most people at this conference) don't have tons of extra money to spend on mediocre meals when I'm traveling.  $10 for a slice of generic pizza, small side salad and a soda for lunch.   I understand it's a hotel but there weren't any options close by.  Just getting your car from valet was a hassle and took a lot of time.  Being such a big property, it made getting to restaurants off the property really time intensive.  Since you're so far out of Nashville (out near the airport), the good little holes you find when you're in a city are pretty nonexistent.  \n\nThe property itself was great.  The hotel is HUGE but really pretty.  I enjoyed walking around but was really happy when I found what I didn't know existed...a shortcut between my room and the Convention Center.  It took my 10-15 minute walk down to about 3 minutes!  BONUS!  Like I said, this place is ginormous.  \n\nRoom: Our room was great.  I shared a wonderful suite in the Garden Conservatory with 2 other girls.  We were under a group rate and my friend was quoted $200/night, which is awesome for the space we had.  We had a large room (probably used as a hospitality suite for groups) for socializing.  It had a great bar area set-up and a nice big fridge and lots of drawer space.  Our bedroom was separated by doors that could be locked from either side (like an adjoining room), so it looked like the hospitality suite could be reserved without reserving the room.  It was different than what I was expecting, but whatevs.  It was fine.  So, I wasn't there at check-in.  The girl who reserved the room checked in a couple days earlier than my friend and I.  So, Sunday comes, and the bill was waiting for us when we woke up.  Our friend was charged $1200 for one room (I'm guessing the suite) and $1400 for the other room.  YEP.  She reserved what she thought was a 2 room suite for $200.  The bedroom door was closed when she got there and she asked them to open it up. It was all arranged by the bellman.  She was never told that the bedroom wasn't included....kind of necessary if you're staying over for 6 nights, dontcha think???  So, she's being charged $2600 for what was supposed to be $1200.  Last I heard, the Gaylord's legal department was investigating what she was told, what she wasn't told and if they should charge her the entire amount.  \n\nCheckout:  A FREAKING NIGHTMARE.  Between the money situation, which was not resolved as of late this week, and the 45 minute wait for a cart (in a hotel that holds thousands of people, you'd think they'd be plentiful and they aren't) and a 25 minute wait for the car, my friend and I decided to sweat it out and schlep our goods to the door where our car would be delivered to us.  It was not a short walk and we had a TON of stuff, which meant multiple trips.  UGH.\n\nI'm sure I'll be back for another conference (I am pretty sure my company has booked this for at least one more year....) but I'm not going to be happy about it.  I might even consider driving down, staying in a hotel somewhere downtown and driving out to the Conference stuff."
    },
    "pair_939": {
        "Text 1": "Prep & Pastry is a must-visit spot with incredible food and a bustling atmosphere. Arrive early or late to avoid the long wait, but trust me, it's worth it. Their green eggs & ham, bloody marys, and mimosas are to die for. The staff even surprised me with a delectable birthday pastry, although I can't recall its name. Plus, they serve locally roasted EXO coffee, elevating the breakfast experience to perfection.",
        "Text 2": "If you want to eat at Prep & Pastry on the weekends, go right when it opens or before it closes. There is always a long wait because of how busy it gets - but the wait is always worth it. The food there is absolutely amazing. I go there often and love the green eggs & ham, bloody marys, and mimosas! They gave me a free pastry on my birthday once, it was delicious! I wish I remembered what it was called. \n\nI also love that they serve EXO coffee here (a local coffee) - nothing better than a great breakfast with great coffee to go with it!",
        "Preferred": "Human",
        "chosentext": "If you want to eat at Prep & Pastry on the weekends, go right when it opens or before it closes. There is always a long wait because of how busy it gets - but the wait is always worth it. The food there is absolutely amazing. I go there often and love the green eggs & ham, bloody marys, and mimosas! They gave me a free pastry on my birthday once, it was delicious! I wish I remembered what it was called. \n\nI also love that they serve EXO coffee here (a local coffee) - nothing better than a great breakfast with great coffee to go with it!"
    },
    "pair_482": {
        "Text 1": "Gus, the falafel nazi, lives up to his reputation and more. Delicious chicken cooked over coal, perfectly cooked falafel, and fresh ingredients. Generous portions and worth the wait!",
        "Text 2": "After trying twice unsuccessfully to get there early enough to get a meal within 20 minutes, I finally was able to break away from work and was 5th in line. I had heard of the \"food truck nazi\" and that it was the best in town and found Gus, the falafel nazi, as he called himself, lived up to his reputation and more. \nAs my turn came up, I approached the cart tenuously, for I did not want to blow it by asking too many questions. He immediately recognized me as a new customer and told me all about the fresh ingredients he uses.\nChicken is cooked over coal and was tender on the inside and perfectly cooked on the outside. Falafel was delicious, as were the grapes and his homemade pasta that went along with it.\nThere was enough food for 2 people.\nWell worth the wait!",
        "Preferred": "AI",
        "chosentext": "Gus, the falafel nazi, lives up to his reputation and more. Delicious chicken cooked over coal, perfectly cooked falafel, and fresh ingredients. Generous portions and worth the wait!"
    },
    "pair_1612": {
        "Text 1": "So happy I found a bomb local sushi place!! Always ignored this shop going to domino's but I'm so glad I popped in. Will be coming here more than I should from now on. I got this sushiya roll and I was more than pleased! The salmon tasted fresh and the miso was on point. 10/10 recommend this spot.",
        "Text 2": "I stumbled upon this hidden gem of a sushi place and it was a game-changer. I used to overlook it for fast food chains, but no more. I had the delicious sushiya roll and it exceeded my expectations. The salmon was incredibly fresh and the miso soup was just perfect. I highly recommend this spot, it deserves a perfect 10/10 rating.",
        "Preferred": "Human",
        "chosentext": "So happy I found a bomb local sushi place!! Always ignored this shop going to domino's but I'm so glad I popped in. Will be coming here more than I should from now on. I got this sushiya roll and I was more than pleased! The salmon tasted fresh and the miso was on point. 10/10 recommend this spot."
    },
    "pair_1900": {
        "Text 1": "Decent bar/restaurant with typical menu options. Food quality was average, but the standout was the exceptional service.",
        "Text 2": "Pretty average bar/restaurant with the menu offerings you can expect from a place like this. The food was OK, and the service was excellent.",
        "Preferred": "AI",
        "chosentext": "Decent bar/restaurant with typical menu options. Food quality was average, but the standout was the exceptional service."
    },
    "pair_1875": {
        "Text 1": "The service and cleanliness of the restaurant were excellent. However, the food was average, particularly the rotini primavera which should be avoided. Although the sauce had a delicious taste, the vegetables were clearly sourced from frozen products, which was disappointing. Considering the abundance of fresh produce available in Tucson, it is unnecessary to use frozen vegetables in dishes.",
        "Text 2": "The service was great and the restaurant was clean, but the food was just okay. We had the linguine with marinara and the rotini primavera. The linguine was fine. The primavera, however, is not something anyone should order!!! The sauce had a great flavor, but the vegetables were actually from frozen. I mean, literally from FROZEN. Go to your local grocery store, look at the bag of Bird's Eye mixed vegetables and you will see what they use... right down to the ruffle cut carrots. There is so much wonderful fresh produce in Tucson, there is absolutely no reason to ever use gross frozen vegetables.",
        "Preferred": "Human",
        "chosentext": "The service was great and the restaurant was clean, but the food was just okay. We had the linguine with marinara and the rotini primavera. The linguine was fine. The primavera, however, is not something anyone should order!!! The sauce had a great flavor, but the vegetables were actually from frozen. I mean, literally from FROZEN. Go to your local grocery store, look at the bag of Bird's Eye mixed vegetables and you will see what they use... right down to the ruffle cut carrots. There is so much wonderful fresh produce in Tucson, there is absolutely no reason to ever use gross frozen vegetables."
    },
    "pair_1507": {
        "Text 1": "We had a delightful stay at this beautiful and charming hotel during our family trip to the Big Easy. The staff, from the doorman to the wait staff for brunch, were incredibly friendly and helpful. The Carousel Bar is a must-visit. With its great location, we will definitely be returning next time we're in New Orleans.",
        "Text 2": "Stayed here with the family for six nights on a trip to the Big Easy. A beautiful and charming place to stay. The staff from the doorman to the wait staff for brunch were  friendly and helpful.  The Carousel Bar is a must. \n\nGreat location, will be going back there for sure next time we are in New Orleans.",
        "Preferred": "AI",
        "chosentext": "We had a delightful stay at this beautiful and charming hotel during our family trip to the Big Easy. The staff, from the doorman to the wait staff for brunch, were incredibly friendly and helpful. The Carousel Bar is a must-visit. With its great location, we will definitely be returning next time we're in New Orleans."
    },
    "pair_1666": {
        "Text 1": "Very nice restaurant in the heart of downtown St. Petersburg with a nice homey feel to it. The burgers full of flavor and the arugula is a fine touch to the chicken and potato gratin meal.  I was not a fan of the cheese used in the potatoes gratin but will definitely be. Ack for the burger. Wine was a little high priced so I didn't get any. The atmosphere is very nice and so was our waitress.",
        "Text 2": "I had a fantastic experience at this downtown St. Petersburg restaurant. The cozy ambiance gave it a homely feel, and the burgers were bursting with flavor. The arugula added a delightful touch to the chicken and potato gratin. However, I wasn't a fan of the cheese used in the gratin. Despite this, I will definitely be back for the burgers. The only downside was the slightly high prices for wine, so I opted not to order any. Overall, the atmosphere was wonderful, and our waitress was excellent.",
        "Preferred": "AI",
        "chosentext": "I had a fantastic experience at this downtown St. Petersburg restaurant. The cozy ambiance gave it a homely feel, and the burgers were bursting with flavor. The arugula added a delightful touch to the chicken and potato gratin. However, I wasn't a fan of the cheese used in the gratin. Despite this, I will definitely be back for the burgers. The only downside was the slightly high prices for wine, so I opted not to order any. Overall, the atmosphere was wonderful, and our waitress was excellent."
    },
    "pair_569": {
        "Text 1": "This is my first choice whenever we decide to go out to dinner! They have a huge selection of foods that will fit any type of person who will be dining there. Their staff is super nice and will accommodate to whatever your needs may be! The restaurant itself is beautiful and very relaxing. In my opinion, Fellinis of media has the best Italian cuisine around.",
        "Text 2": "Fellinis of Media is my top pick for dining out! Their extensive menu caters to all tastes, and the friendly staff goes above and beyond to meet your needs. The elegant and serene ambiance adds to the overall experience. In my view, this restaurant offers the finest Italian cuisine in town.",
        "Preferred": "AI",
        "chosentext": "Fellinis of Media is my top pick for dining out! Their extensive menu caters to all tastes, and the friendly staff goes above and beyond to meet your needs. The elegant and serene ambiance adds to the overall experience. In my view, this restaurant offers the finest Italian cuisine in town."
    },
    "pair_729": {
        "Text 1": "A.I. DuPont is the best family hospital on the East Coast. They excel in coordinating multiple MD visits in a single day and provide exceptional care. The renovated wing offers great caregiver accommodations and the staff is friendly and attentive. Highly recommend traveling from NY for child's care.",
        "Text 2": "This hospital is by far the best for families on the East Coast. They make seeing multiple MDs on the same day very easy and the quality of care is incredible. The renovated wing is fantastic with good accommodations for caregivers and friendly and attentive staff. I wholeheartedly recommend A.I. DuPont and will continue to travel from NY for my child's care.",
        "Preferred": "Human",
        "chosentext": "This hospital is by far the best for families on the East Coast. They make seeing multiple MDs on the same day very easy and the quality of care is incredible. The renovated wing is fantastic with good accommodations for caregivers and friendly and attentive staff. I wholeheartedly recommend A.I. DuPont and will continue to travel from NY for my child's care."
    },
    "pair_1665": {
        "Text 1": "The hotel was a decent option in downtown Tampa. We stayed in the suite with a fold-out couch, which was comfortable. We unfortunately missed the happy hour with free drinks, but it's a cool amenity. The complimentary breakfast was amazing, featuring made-to-order omelets, fresh fruit, cereal, toast, bacon, sausage, home fries, juice, and pastries. The room was modern, with two TVs, clean, and had a strong shower.",
        "Text 2": "Decent hotel in downtown Tampa. Stayed in the suite with the fold out couch.  This place has a happy hour with FREE drinks, which we missed, but how cool. The complimentary breakfast was awesome.  Made to order omelets, fresh fruit, cereal, toast, bacon, sausage, home fries, juice and pastries.  Did I mention it was complimentary?   Easiest the best free breakfast I've ever had.  Room was nice and modern with two TV's etc.  Clean and a strong shower.",
        "Preferred": "Human",
        "chosentext": "Decent hotel in downtown Tampa. Stayed in the suite with the fold out couch.  This place has a happy hour with FREE drinks, which we missed, but how cool. The complimentary breakfast was awesome.  Made to order omelets, fresh fruit, cereal, toast, bacon, sausage, home fries, juice and pastries.  Did I mention it was complimentary?   Easiest the best free breakfast I've ever had.  Room was nice and modern with two TV's etc.  Clean and a strong shower."
    },
    "pair_39": {
        "Text 1": "Amazing biscuits and (fill in the blank). Great cocktails too. Highly recommended. A bit busy though.",
        "Text 2": "The biscuits are amazing and (fill in the blank) is delectable. Cocktails are top-notch. Highly recommended, although it can get a bit busy.",
        "Preferred": "AI",
        "chosentext": "The biscuits are amazing and (fill in the blank) is delectable. Cocktails are top-notch. Highly recommended, although it can get a bit busy."
    },
    "pair_381": {
        "Text 1": "What an AMAZING occurrence that we ended up here after another barbecue place ran out of food!\n\nSo yeah, we started out at another spot and they were out of food when we got there. Super bummed and still in the mood for barbecue, we started wandering around Mid City and my trusty Yelp app guided me to this place. We were greeted by the super nice woman working the counter and she explained the whole process.\n\nI decided to get the one-meat plate with \"wet\" pulled pork, grits and potato salad, I also got a medium mac and cheese, because I can. My boyfriend got the two-meat plate with brisket and pulled chicken with potato salad and fries. The food blew us both away! It was delicious from beginning to end. The pulled pork was perfect and had the perfect amount of sauce without being drenched. I could tell that if I hadn't ordered it wet it still would have been able to stand on it's own. The mac and cheese was incredible, and after the pork, was my favorite part of the meal. The stone ground grits had a different type of flavor (almost smoky) that I enjoyed and the potato salad was served cold and had that nice crunch that I like in potato salad,\n\nWe both agreed that the food was excellent, and a good deal to boot, and that we would both make the trip back out to Earhart, just to have more of this delicious food. The owner himself was bringing the food out to folks and he was really friendly and made sure that we were happy with everything. I like when the owners take the time to make sure that everything is okay. The atmosphere is casual and comfortable and the entire process was a breeze. I will definitely return to LA Smokehouse and I'll be adding it to my \"BBQ Favorites\" list for future reference.",
        "Text 2": "LA Smokehouse is absolutely amazing! After being let down by another barbecue place, we stumbled upon this gem in Mid City. The friendly staff explained everything and the food blew us away. The pulled pork was perfection, not overly sauced. The mac and cheese were incredible, and the grits had a unique smoky flavor. The owner made sure we were happy and the atmosphere was casual and comfortable. We'll definitely be coming back for more of this delicious food. LA Smokehouse is now on our BBQ favorites list!",
        "Preferred": "Human",
        "chosentext": "What an AMAZING occurrence that we ended up here after another barbecue place ran out of food!\n\nSo yeah, we started out at another spot and they were out of food when we got there. Super bummed and still in the mood for barbecue, we started wandering around Mid City and my trusty Yelp app guided me to this place. We were greeted by the super nice woman working the counter and she explained the whole process.\n\nI decided to get the one-meat plate with \"wet\" pulled pork, grits and potato salad, I also got a medium mac and cheese, because I can. My boyfriend got the two-meat plate with brisket and pulled chicken with potato salad and fries. The food blew us both away! It was delicious from beginning to end. The pulled pork was perfect and had the perfect amount of sauce without being drenched. I could tell that if I hadn't ordered it wet it still would have been able to stand on it's own. The mac and cheese was incredible, and after the pork, was my favorite part of the meal. The stone ground grits had a different type of flavor (almost smoky) that I enjoyed and the potato salad was served cold and had that nice crunch that I like in potato salad,\n\nWe both agreed that the food was excellent, and a good deal to boot, and that we would both make the trip back out to Earhart, just to have more of this delicious food. The owner himself was bringing the food out to folks and he was really friendly and made sure that we were happy with everything. I like when the owners take the time to make sure that everything is okay. The atmosphere is casual and comfortable and the entire process was a breeze. I will definitely return to LA Smokehouse and I'll be adding it to my \"BBQ Favorites\" list for future reference."
    },
    "pair_540": {
        "Text 1": "Drum-roll please! Review #100 coming right up! \n\nI chose to review Starbucks as my 100th review because it is a guilty pleasure. Something that I only allow myself once a week. But something that I crave everyday! \n\nThis particular Starbucks is great. The baristas are always friendly and welcoming. The drinks are made correctly and quickly. I usually go with a Salted Caramel Hot Chocolate or Mocha. I also occasionally order the White Mocha. If you can't tell, I enjoy coffee that doesn't taste like coffee! In the summer their iced teas are the perfect thirst quencher! Their breakfast pastry items are always delicious. Try the Cranberry-Orange Scone and you will not be disappointed! Their breakfast sandwiches are unique and pretty tasty as well.\n\nI always choose to go in and place my order over sitting in the drive thru. The line for their drive thru is always ridiculously long. It's usually quicker to go in!",
        "Text 2": "Starbucks is a great guilty pleasure with friendly baristas, delicious drinks, and tasty pastries. The drive-thru line is long, but going in to order is quicker. Highly recommended!",
        "Preferred": "Human",
        "chosentext": "Drum-roll please! Review #100 coming right up! \n\nI chose to review Starbucks as my 100th review because it is a guilty pleasure. Something that I only allow myself once a week. But something that I crave everyday! \n\nThis particular Starbucks is great. The baristas are always friendly and welcoming. The drinks are made correctly and quickly. I usually go with a Salted Caramel Hot Chocolate or Mocha. I also occasionally order the White Mocha. If you can't tell, I enjoy coffee that doesn't taste like coffee! In the summer their iced teas are the perfect thirst quencher! Their breakfast pastry items are always delicious. Try the Cranberry-Orange Scone and you will not be disappointed! Their breakfast sandwiches are unique and pretty tasty as well.\n\nI always choose to go in and place my order over sitting in the drive thru. The line for their drive thru is always ridiculously long. It's usually quicker to go in!"
    }
}